// Данные о релизах музыканта
const releasesData = {
    "youtubeVideoId": "-BWPThUwuaQ", // ID видео на YouTube (замените на свое)
    "releases": [
        {
            "id": 17,
            "title": "Code 47",
            "type": "single",
            "releaseType": "telegram",
            "year": 2025,
            "tracks": 1,
            "duration": "1:51",
            "cover": "assets/images/с47.png",
            "description": "«Code 47» — трек о связи с близкими и ценности поддержки. Через ностальгические образы родного Выборга и личные истории герой показывает, как сила приходит из ответственности перед теми, кто ждёт и верит в тебя. Песня сочетает искренние эмоции, размышления о прошлом и уверенность в настоящем.",
            "shortDescription": "Трек о поддержке близких, ностальгии по дому и силе, которую даёт ответственность перед теми, кто тебя ждёт.",
            "tracksList": [
                {
                    "number": 1, 
                    "title": "Code 47", 
                    "listenUrl": "https://t.me/prostorus_tg/88"  // Ссылка для прослушивания
                }
            ]
        },
        {
            "id": 16,
            "title": "Просто Пиздец",
            "type": "single",
            "releaseType": "telegram",
            "year": 2025,
            "tracks": 1,
            "duration": "3:22",
            "cover": "assets/images/pp.png",
            "description": "«Просто Пиздец» — трек о всепоглощающей влюбленности, когда каждый взгляд, касание и случайная встреча переворачивают мир. Здесь переплетаются нежность, фантазии и необузданный восторг, а эмоции достигают пика, который точнее всего описывается словом «пиздец». Песня переносит слушателя в состояние полного погружения в чувства, где радость и волнение смешаны, словно котенок, случайно появившийся на пути и сразу очаровывающий своим присутствием.",
            "shortDescription": "Энергичный трек о всепоглощающей влюбленности, где каждый момент ощущается как настоящий «пиздец» эмоций и переживаний.",
            "tracksList": [
                {
                    "number": 1, 
                    "title": "Просто Пиздец", 
                    "listenUrl": "https://t.me/prostorus_tg/86"  // Ссылка для прослушивания
                }
            ]
        },
        {
            "id": 15,
            "title": "Мы слушаем, но не осуждаем",
            "type": "album",
            "releaseType": "telegram", // platform или telegram
            "year": 2025,
            "tracks": 9,
            "duration": "21 мин",
            "cover": "assets/images/msnno.jpg",
            "description": "«Мы слушаем, но не осуждаем» — не сборник песен, тотальный аудиодневник срыва, исследование психики через призму творчества. Его название — прямой договор со слушателем: стать свидетелем боли без морализаторства. Герой проходит путь от истерии через сарказм и агрессию к полному выгоранию, стирая грань между персонажем и автором. Это история о том, как творчество из лекарства превращается в яд, а единственным спасением становится честное самоуничтожение.",
            "shortDescription": "«Мы слушаем, но не осуждаем» — аудиодневник внутренней борьбы и исследования психики, где творчество становится одновременно лекарством и ядом, а единственным спасением — честное самоуничтожение.",
            "tracksList": [
                {
                    "number": 1, 
                    "title": "Сдохни или умри (intro)", 
                    "listenUrl": "https://t.me/prostorus_tg/72"  // Ссылка для прослушивания
                },
                {
                    "number": 2, 
                    "title": "ИП Б.З.Д", 
                    "listenUrl": "https://t.me/prostorus_tg/72"
                },
                {
                    "number": 3, 
                    "title": "Взрослый контент", 
                    "listenUrl": "https://t.me/prostorus_tg/72"
                },
                {
                    "number": 4, 
                    "title": "Брось", 
                    "listenUrl": "https://t.me/prostorus_tg/72"
                },
                {
                    "number": 5, 
                    "title": "ПЫЛЬНАЯ БИБЛИОТЕКА (Phonk Remix)", 
                    "listenUrl": "https://t.me/prostorus_tg/72"
                },
                {
                    "number": 6, 
                    "title": "Не хочу", 
                    "listenUrl": "https://t.me/prostorus_tg/73"
                },
                {
                    "number": 7, 
                    "title": "Целуй (feat. ПОЗОРИЩЕ)", 
                    "listenUrl": "https://t.me/prostorus_tg/73"
                },
                {
                    "number": 8, 
                    "title": "Навсегда (feat. МЕЗАМЕР)", 
                    "listenUrl": "https://t.me/prostorus_tg/73"
                },
                {
                    "number": 9, 
                    "title": "Последний момент", 
                    "listenUrl": "https://t.me/prostorus_tg/73"
                }
            ]
        },
        {
            "id": 14,
            "title": "Перекресток",
            "type": "single",
            "releaseType": "telegram",
            "year": 2025,
            "tracks": 1,
            "duration": "1:52",
            "cover": "assets/images/p.png",
            "description": "«Перекрёсток» — экспериментальный трек, объединяющий музыку и повествовательный стиль аудиокниг. История рассказывает о встрече двух людей, чьи чувства сильнее внешних препятствий. Светофор здесь становится метафорой разделения и выбора, но герои решают идти навстречу друг другу, следуя эмоциям и преодолевая преграды. Звуковое оформление — крики водителей, автомобильные сигналы, сирена ДПС — погружает слушателя в реальное пространство и подчёркивает напряжение и радость момента.",
            "shortDescription": "Трек о встрече и любви, которая преодолевает преграды. Светофор символизирует момент выбора, а герои следуют своим чувствам, несмотря на внешние препятствия.",
            "tracksList": [
                {
                    "number": 1, 
                    "title": "Перекресток", 
                    "listenUrl": "https://t.me/prostorus_tg/60"  // Ссылка для прослушивания
                }
            ]
        },
        {
            "id": 13,
            "title": "На собственных глазах",
            "type": "single",
            "releaseType": "telegram",
            "year": 2025,
            "tracks": 1,
            "duration": "1:52",
            "cover": "assets/images/nsg.png",
            "description": "«На собственных глазах» — трек о пространстве между светом и тенью, о поиске и утрате, где границы реальности и эмоций расплывчаты. Песня передаёт ощущение невозможности найти покой, когда близкие люди удаляются и время теряет привычный ритм. Герой наблюдает уход света и сталкивается с личной болью, оставаясь один на пересечении памяти и настоящего.\n\nКомпозиция сочетает меланхолию и эмоциональную напряжённость, создавая атмосферу глубокого внутреннего диалога. «На собственных глазах» — это трек о том, как важно ценить моменты и осознавать хрупкость человеческих отношений.",
            "shortDescription": "Меланхоличный трек о поиске и утрате, где герой сталкивается с уходом близкого человека и невозможностью найти покой.",
            "tracksList": [
                {
                    "number": 1, 
                    "title": "На собственных глазах", 
                    "listenUrl": "https://t.me/prostorus_tg/56"  // Ссылка для прослушивания
                }
            ]
        },
        {
            "id": 12,
            "title": "Путь до сердца",
            "type": "single",
            "releaseType": "telegram",
            "year": 2025,
            "tracks": 1,
            "duration": "2:52",
            "cover": "assets/images/pds.png",
            "description": "«Путь до сердца» — трек о любви, благодарности и эмоциональной близости. Песня передаёт искреннее признание в чувствах, где любимый человек становится источником силы, вдохновения и внутреннего равновесия. Герой осознаёт, что только этот человек способен собрать его воедино и провести через любые жизненные трудности.\n\nКомпозиция раскрывает тему доверия и взаимопонимания, а также ценность простых моментов совместной жизни. «Путь до сердца» — это трек о том, как любовь становится опорой и путеводной звездой, придавая смысл и гармонию повседневности.",
            "shortDescription": "Трек о любви, доверии и эмоциональной близости, где любимый человек становится источником силы и внутреннего равновесия.",
            "tracksList": [
                {
                    "number": 1, 
                    "title": "Путь до сердца", 
                    "listenUrl": "https://t.me/prostorus_tg/55"  // Ссылка для прослушивания
                }
            ]
        },
        {
            "id": 11,
            "title": "DARK ROCKSTAR",
            "type": "single",
            "releaseType": "telegram",
            "year": 2025,
            "tracks": 1,
            "duration": "2:38",
            "cover": "assets/images/dr.png",
            "description": "«DARK ROCKSTAR» — трек о внутренней борьбе, преодолении страхов и поиске счастья в повседневной жизни. Герой проходит через тени прошлого, сомнения и зависть, но выбирает созидание, рост и движение вперёд. Музыка передаёт атмосферу личной трансформации, где рок-н-ролл и элементы рефлексии соединяются в эмоциональный рассказ.\n\nКомпозиция фиксирует момент осознания: счастье рядом, если его заметить, несмотря на ошибки, разочарования и прошлые потери. «DARK ROCKSTAR» — трек о принятии себя, ответственности за свою жизнь и стремлении к личной гармонии, где каждый слушатель может найти что-то своё.",
            "shortDescription": "Трек о преодолении страхов и сомнений, поиске счастья и личной гармонии через внутреннюю борьбу и рост.",
            "tracksList": [
                {
                    "number": 1, 
                    "title": "DARK ROCKSTAR", 
                    "listenUrl": "https://t.me/prostorus_tg/54"  // Ссылка для прослушивания
                }
            ]
        },
        {
            "id": 10,
            "title": "Родной поток",
            "type": "single",
            "releaseType": "telegram",
            "year": 2025,
            "tracks": 1,
            "duration": "2:10",
            "cover": "assets/images/rp.png",
            "description": "«Родной поток» — трек о любви, поиске и эмоциональной близости. Музыкальная атмосфера, растянутая гитарным минором, передаёт чувство времени и постепенного приближения к важному человеку. Здесь герою предстоит пройти через внутренние переживания и прошлые раны, чтобы осознать ценность настоящих отношений.\n\nКомпозиция фиксирует момент, когда усилия, память и эмоции приводят к гармонии с другим человеком. Это трек о доверии, о преодолении трудностей и о том, как важные встречи могут изменить жизнь, делая близость глубокой и осознанной. «Родной поток» — про искреннюю любовь, внимание к деталям и силу совместного пути.",
            "shortDescription": "Трек о любви, доверии и эмоциональной близости, где усилия и память приводят к гармонии с важным человеком.",
            "tracksList": [
                {
                    "number": 1, 
                    "title": "Родной поток", 
                    "listenUrl": "https://t.me/prostorus_tg/52"  // Ссылка для прослушивания
                }
            ]
        },
        {
            "id": 9,
            "title": "ПЫЛЬНАЯ БИБЛИОТЕКА",
            "type": "single",
            "releaseType": "telegram",
            "year": 2025,
            "tracks": 1,
            "duration": "2:30",
            "cover": "assets/images/pb.png",
            "description": "«ПЫЛЬНАЯ БИБЛИОТЕКА» — продолжение истории, начатой в «ЗАМКНУТОМ ФЕВРАЛЕ». Трек использует метафору книг и библиотек как отражение прошлого, утонувшего в пыли воспоминаний, и внутренней двоякости героя, пытающегося переосмыслить свои ощущения и опыт.\n\nКомпозиция создаёт атмосферу блуждания среди разрушенных жанров, открытых и запертых смыслов, где каждая страница становится частью личного поиска. Герой сталкивается с сомнениями, внешними ограничениями и собственной ответственностью за понимание и интерпретацию своего мира. «ПЫЛЬНАЯ БИБЛИОТЕКА» — это трек о внимании к деталям, внутреннем диалоге и поиске гармонии в хаосе воспоминаний.",
            "shortDescription": "Трек о внутреннем поиске и переосмыслении прошлого через метафору книг и библиотек, блуждание среди памяти и сомнений.",
            "tracksList": [
                {
                    "number": 1, 
                    "title": "ПЫЛЬНАЯ БИБЛИОТЕКА", 
                    "listenUrl": "https://t.me/prostorus_tg/51"  // Ссылка для прослушивания
                }
            ]
        },
        {
            "id": 8,
            "title": "ЗАМКНУТЫЙ ФЕВРАЛЬ",
            "type": "single",
            "releaseType": "telegram",
            "year": 2025,
            "tracks": 1,
            "duration": "2:37",
            "cover": "assets/images/zf.png",
            "description": "«ЗАМКНУТЫЙ ФЕВРАЛЬ» — это музыкальный рассказ о внутренней борьбе и поиске гармонии, где прошлое оживает через образ старых книг, а будущее манит свежестью зимы. Трек сочетает рефлексию, меланхолию и тихую надежду, фиксируя момент, когда герой пытается найти путь к себе и к своему эмоциональному миру.\n\nКомпозиция ведёт через образы и главы, каждая из которых отражает этапы осмысления, принятия утрат и личного роста. Здесь нет громкой драматизации — есть честная фиксация внутреннего состояния, когда решения приходят постепенно, а путь к новым открытиям сопровождается вниманием к себе и своим чувствам. «ЗАМКНУТЫЙ ФЕВРАЛЬ» — трек для тех, кто ищет свет внутри зимней темноты и готов встречать свои эмоции без прикрас.",
            "shortDescription": "Трек о внутренней борьбе, поиске гармонии и надежде, скрытой за зимней тьмой и образами прошлого.",
            "tracksList": [
                {
                    "number": 1, 
                    "title": "ЗАМКНУТЫЙ ФЕВРАЛЬ", 
                    "listenUrl": "https://t.me/prostorus_tg/45"  // Ссылка для прослушивания
                }
            ]
        },
		{
            "id": 7,
            "title": "Жми дерьмо!",
            "type": "single",
            "releaseType": "platform",
            "year": 2025,
            "tracks": 1,
            "duration": "2:15",
            "cover": "https://avatars.yandex.net/get-music-content/13663712/4c75828d.a.35160440-1/m1000x1000",
            "description": "«Жми дерьмо!» — энергичный и агрессивный трек о внутренней силе, самодисциплине и преодолении собственных слабостей. Это гимн личной ответственности за себя, за свои эмоции и тело, где физическая энергия соединяется с эмоциональной, а спорт и музыка становятся способом переработать стресс и боль.\n\nТрек фиксирует состояние, в котором нет места иллюзиям: только честная работа над собой, физическая и ментальная прокачка. Он обращён к тем, кто готов столкнуться со своими страхами, принять силу внутри и двигаться вперёд, несмотря на утраты, разочарования или непонимание окружающих.",
            "shortDescription": "Энергичный трек о внутренней силе, самодисциплине и преодолении собственных слабостей через музыку и физическую работу над собой.",
            "tracksList": [
                {
                    "number": 1, 
                    "title": "Жми дерьмо!", 
                    "listenUrl": "https://band.link/jmi_dermo"  // Ссылка для прослушивания
                }
            ]
        },
        {
            "id": 6,
            "title": "Предложение",
            "type": "ep",
            "releaseType": "telegram",
            "year": 2025,
            "tracks": 5,
            "duration": "7 мин",
            "cover": "assets/images/pr.jpg",
            "description": "«Предложение» — мини-альбом, построенный как личная история взросления, сомнений и принятия решения, от которого невозможно отступить. Альбом ведёт слушателя через внутренние переживания: ночные размышления, страхи, моменты уязвимости и надежды, приближая к точке эмоционального пика — решению, которое меняет всё.\n\nКаждый трек мини-альбома отражает честный диалог с собой и с чувствами, без прикрас и шаблонных драм. Это история о том, как важно быть искренним перед собой и теми, кого любишь, несмотря на страхи и прошлые ошибки. «Предложение» фиксирует момент перехода от сомнений к действию, создавая эмоциональную линию, которую можно прочувствовать всем сердцем.",
            "shortDescription": "Мини-альбом о сомнениях, внутреннем росте и принятии судьбоносного решения, отражающий честный диалог с собой и своими чувствами.",
            "tracksList": [
                {
                    "number": 1, 
                    "title": "Предложение (intro)", 
                    "listenUrl": "https://t.me/prostorus_tg/20"
                },
                {
                    "number": 2, 
                    "title": "Первые шаги", 
                    "listenUrl": "https://t.me/prostorus_tg/20"
                },
                {
                    "number": 3, 
                    "title": "Предложение", 
                    "listenUrl": "https://t.me/prostorus_tg/20"
                },
                {
                    "number": 4, 
                    "title": "Слово автора", 
                    "listenUrl": "https://t.me/prostorus_tg/20"
                }
            ]
        },
        {
            "id": 5,
            "title": "Обнуляй (Reimagine)",
            "type": "single",
            "releaseType": "telegram",
            "year": 2024,
            "tracks": 1,
            "duration": "2:45",
            "cover": "assets/images/objn.jpg",
            "description": "«Обнуляй (Reimagine)» — художественное переосмысление оригинального трека, предлагающее альтернативный взгляд на прошлые события и эмоциональные переживания. Композиция фиксирует момент, когда старая история отпускается, а эмоции перерабатываются в новую форму, создавая пространство для внутреннего освобождения.\n\nТекст трека балансирует между искренней уязвимостью и отчуждением, показывая, что отпускание прошлого — это не капитуляция, а переосмысление и реструктуризация собственного опыта. Каждая строка — как маленький шаг к обнулению старых обид, повторов и иллюзий, создавая новый эмоциональный тон и художественную перспективу.\n\n«Обнуляй (Reimagine)» — это музыка для тех, кто ищет свежий взгляд на старые истории и готов встречать их без иллюзий, но с честью и вниманием к себе и другим.",
            "shortDescription": "Альтернативная версия трека «Обнуляй», переосмысляющая прошлое и создающая новую эмоциональную перспективу.",
            "tracksList": [
                {
                    "number": 1, 
                    "title": "Обнуляй (Reimagine)", 
                    "listenUrl": "https://t.me/prostorus_tg/8"  // Ссылка для прослушивания
                }
            ]
        },
        {
            "id": 4,
            "title": "Сфотографируй вушбайк",
            "type": "single",
            "releaseType": "telegram",
            "year": 2024,
            "tracks": 1,
            "duration": "1:22",
            "cover": "assets/images/vsh.jpg",
            "description": "«Сфотографируй вушбайк» — трек о том, как прошлое остаётся с нами даже после того, как всё закончилось. Это музыкальная фиксация момента, когда любовь уходит, но след её присутствия остаётся в памяти, привычках и внутреннем ощущении мира.\n\nТекст и образы трека создают ощущение осторожного погружения в воспоминания и внутренние переживания: редкие, но сильные импульсы эмоций, моменты боли и тепла, которые невозможно стереть. Композиция передаёт баланс между прощанием и уважением к тому, что было, а также чувство, что каждый слушатель может найти здесь что-то своё — личное и неповторимое.\n\nМузыка сопровождает эти мысли мягко, но точно: она не пытается драматизировать, а фиксирует состояние честно, как дневниковую запись, оставленную на полях сознания.",
            "shortDescription": "Рефлексивный трек о прощании с прошлым и следах любви, которые остаются даже после ухода.",
            "tracksList": [
                {
                    "number": 1, 
                    "title": "Сфотографируй вушбайк", 
                    "listenUrl": "https://t.me/prostorus_tg/8"  // Ссылка для прослушивания
                }
            ]
        },
        {
            "id": 3,
            "title": "ЛЮБОВЬ КАК ПОСТИРОНИЯ",
            "type": "single",
            "releaseType": "platform",
            "year": 2024,
            "tracks": 1,
            "duration": "2:39",
            "cover": "https://avatars.yandex.net/get-music-content/14247687/8de58a6d.a.29257014-3/m1000x1000",
            "description": "«ЛЮБОВЬ КАК ПОСТИРОНИЯ» — это эмоционально обнажённый трек о разрушительных последствиях близости, в которой слова перестали быть услышанными. Здесь любовь показана не как спасение, а как ироничная и болезненная форма привязанности, оставляющая после себя опустошение и чувство вины.\n\nТекст выстроен как поток сознания человека, застрявшего в состоянии внутреннего краха: бессонные ночи, невозможность диалога и ощущение, что любые попытки что-то исправить приходят слишком поздно. Повторяющиеся образы замкнутого пространства усиливают чувство безвыходности и эмоциональной изоляции.\n\nКульминацией трека становится честный вопрос, обращённый не к другому человеку, а к самому себе — попытка осознать собственные поступки и ответственность за причинённую боль. «ЛЮБОВЬ КАК ПОСТИРОНИЯ» фиксирует момент, когда чувства перестают быть романтичными и превращаются в тяжёлый, но необходимый этап взросления.",
            "shortDescription": "Жёсткий и уязвимый трек о любви, которая разрушает, оставляя после себя тишину, вину и внутренний конфликт.",
            "tracksList": [
                {
                    "number": 1, 
                    "title": "ЛЮБОВЬ КАК ПОСТИРОНИЯ", 
                    "listenUrl": "https://band.link/smblap"  // Ссылка для прослушивания
                }
            ]
        },
        {
            "id": 2,
            "title": "МИР! ДРУЖБА! ПЯТЬ УТРА...",
            "type": "single",
            "releaseType": "vk",
            "year": 2023,
            "tracks": 1,
            "duration": "2:29",
            "cover": "assets/images/mdp.jpg",
            "description": "«МИР! ДРУЖБА! ПЯТЬ УТРА…» — это ночная исповедь человека, застрявшего между прошлым и невозможностью его переписать. Трек фиксирует состояние бессонницы, когда мысли бесконечно прокручивают утраченные моменты, несказанные слова и решения, которые уже нельзя отменить.\n\nМузыка и текст здесь работают как внутренний диалог: попытка разобраться в чувствах, где любовь переплетается с дружбой, а привязанность — с болью и чувством вины. Повторяющийся мотив «начать с начала» звучит не как надежда, а как осознание того, что возврата нет, и всё, что остаётся — принять текущую форму связи.\n\nТрек наполнен уязвимостью и усталой честностью. Он не стремится к драме, а скорее фиксирует эмоциональное истощение и тихое желание, чтобы близкому человеку было хорошо — даже если это означает существовать на расстоянии и в ограниченных рамках. «МИР! ДРУЖБА! ПЯТЬ УТРА…» — это музыка для тех моментов, когда ночь длиннее дня, а чувства сложнее любых слов.",
            "shortDescription": "Ночная исповедь о бессоннице, утраченной близости и попытке сохранить связь, даже когда всё уже не вернуть.",
            "tracksList": [
                {
                    "number": 1, 
                    "title": "МИР! ДРУЖБА! ПЯТЬ УТРА...", 
                    "listenUrl": "https://vk.com/music/playlist/-204454570_14_aeb311ee0d17eac2cd"  // Ссылка для прослушивания
                }
            ]
        },
        {
            "id": 1,
            "title": "#ТАНЦЫНАКОСТЯХ",
            "type": "single",
            "releaseType": "vk",
            "year": 2022,
            "tracks": 1,
            "duration": "2:37",
            "cover": "assets/images/tnk.jpg",
            "description": "#ТАНЦЫНАКОСТЯХ — это жёсткая и тревожная фиксация состояния, в котором мир перестаёт быть безопасным, а будущее — очевидным. Трек построен на ощущении застоя и постоянного присутствия смерти, которое не проговаривается напрямую, но ощущается в каждом образе.\n\nНазвание и припев работают как метафора вынужденного существования: танец здесь — не праздник, а способ не остановиться, когда вокруг рушатся смыслы и исчезают ориентиры. Повторяющаяся формула \"ради сыновей и пап\" выводит личную боль за пределы одного человека, превращая её в коллективный опыт.\n\nКосмические и апокалиптические образы усиливают чувство отчуждения и управляемого хаоса — как будто человек запущен в систему, где маршрут давно проложен кем-то другим. При этом трек удерживает главный нерв — отказ принимать смерть как норму и попытку сопротивляться, даже когда это кажется иллюзией.",
            "shortDescription": "Мрачный и агрессивный трек о выживании в реальности, где человеческая жизнь превращается в расходный материал, а сопротивление становится единственной формой движения.",
            "tracksList": [
                {
                    "number": 1, 
                    "title": "#ТАНЦЫНАКОСТЯХ (feat. Maxim Ganin)", 
                    "listenUrl": "https://vk.com/music/playlist/-204454570_10_39490b84e0118b5112"  // Ссылка для прослушивания
                }
            ]
        }
    ]
};

// Типы релизов на русском
const releaseTypes = {
    "album": "Альбом",
    "single": "Сингл",
    "ep": "Мини-альбом"
};

// Типы выпуска на русском
const releaseTypeNames = {
    "platform": "Площадки",
    "telegram": "Telegram",
	"vk": "VK"
};